Terraform plan for __ibo__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.bq_grafana_key_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "bq_grafana_key_bucket_object" {
      - cache_control       = "" -> null
      ~ content             = (sensitive value) # forces replacement
      - content_disposition = "" -> null
      - content_encoding    = "" -> null
      - content_language    = "" -> null
      ~ content_type        = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c              = "9AYvJA==" -> (known after apply)
      ~ detect_md5hash      = "Mkv8Uf7flV/P4XzUXAyWXA==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "**********************************" -> (known after apply)
      ~ kms_key_name        = "" -> (known after apply)
      ~ md5hash             = "Mkv8Uf7flV/P4XzUXAyWXA==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/ibo-prod/o/bigquery-grafana-prod.key?generation=1637837070226304&alt=media" -> (known after apply)
      - metadata            = {} -> null
        name                = "bigquery-grafana-prod.key"
      ~ output_name         = "bigquery-grafana-prod.key" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/ibo-prod/o/bigquery-grafana-prod.key" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #341](https://github.com/ebomart/commerce-infrastructure/actions/runs/1503347865)